from AxRobotData import *
import AxRobotData

#**********************************************************
# MotionParam_AxRobot.py
#**********************************************************
                             #**可依實際需求改變編號順序
ecatDevices=[1,2,3,4,5,6,7,8,9]        #**網路連線順序
ecatDeviceN= 0;                        #**網路裝置總數
ecatServoN = 0;                        #**伺服驅動總數

ecatSdoRx0=0x1000;           #**SDO的讀寫區域
ecatSdoRxN=0x80;
ecatSdoTx0=0x1080;
ecatSdoTxN=0x80;
ecatPdoRx0=0x1100;           #**PDO的讀寫區域
ecatPdoRxN=14;
ecatPdoTx0=0x1400;
ecatPdoTxN=14;
                             #**上電時的剎車脫離處理
ecatAngBrake =    300;                            #**剎車脫離的晃動角度
ecatSpdBrake =["",1000,1000,1000,1000,1000,1000,1000];  #**剎車脫離時的速度限制
ecatSpdNormal=["",2500,2500,2500,2500,2500,2500,2500];  #**剎車脫離後的速度限制
                             #**電子齒輪設置

ecatDrvKpN=["",307,489,307,307,431,431,431];      #**POS齒輪比:kpN/kpD
ecatDrvKpD=["",  9,  9,  9,  9, 15, 15, 15];
ecatDrvKvN=["",307,783,307,307,431,431,431];      #**VEL齒輪比:kvN/kvD
ecatDrvKvD=["", 90,144, 90, 90,150,150,150];
ecatDrvKsN=["",307,783,307,307,431,431,431];      #**SPD齒輪比:ksN/ksD
ecatDrvKsD=["", 90,144, 90, 90,150,150,150];
ecatDrvPOS=["",  0,  0,  0,  0,  0,  0,  0];      #**開機角度設置(單位=0.001度)
ecatDrvINV=["",  0,  0,  0,  0,  0,  0,  0];      #**馬達轉動極性(0=正向,1=負向)
ecatDrvSPD=["",300,300,300,300,300,300,300];      #**角度變異限制
ecatDrvOLD=["",  1,  1,  1,  1,  1,  1,  1];      #**剛性設置,0=傳統助力控制, 1=傳統剛性位置控制, 2=傳統剛性速度控制, 3=傳統剛性扭力控制
ecatDrvMxH=["",  0,  0,  0,  0,  0,  0,  0];
ecatDrvMxL=["",  0,  0,  0,  0,  0,  0,  0];

if AxRobotData.SimulationModeEnabled == False:
    ecatCmdSIM=["",  0,  0,  0,  0,  0,  0,  0];
else:
    ecatCmdSIM=["",  1,  1,  1,  1,  1,  1,  1];      #**模擬設置,1=模擬,0=實際裝置

ecatSpdBRK=["",100,100,100,100,100,100,100];      #**剎車脫離時的速度保護
ecatSpdMOV=["",999,999,999,999,999,999,999];      #**正常工作時的速度保護

ecatAngBRK=300;                                   #**剎車脫離時的晃動範圍(30度/減速比)
ecatTimBRK=1.0;                                   #**剎車脫離時的晃動時間
                             #** 模擬用的伺服驅動器
ecatSimKP =["", 500, 500, 500, 500, 500, 500, 500];
ecatSimKV =["",9000,9000,9000,9000,9000,9000,9000];
ecatSimKG =["",1000,1000,1000,1000,1000,1000,1000];
ecatSimKM =["", 200, 200, 200, 200, 200, 200, 200];
ecatSimKA =["", 500, 500, 500, 500, 500, 500, 500];
ecatSimKS =["",  50,  50,  50,  50,  50,  50,  50];
ecatSimKS0=["", 200, 200, 200, 200, 200, 200, 200];
                             #** 助力控制器預設參數
ecatExtKG =["",    0,-1143,   0, -745,    0,  -94,    0];
ecatExtKM =["",    0,    0,   0,    0,    0,    0,    0];
ecatExtKA =["",    0,    0,   0,    0,    0,    0,    0];
ecatExtKV =["", 2696, 2935,2398, 1897,  835,  826,  734];
ecatExtKV0=["",    8,  221,  14,   22,  385,  488,  445];
ecatExtKS =["", 2157, 2028,2238, 1518,  668,  587,  587];
ecatExtKS0=["",    6,  169,  11,   18,  308,  316,  356];

ecatExtSPD=["", 200, 200, 200, 200, 200, 200, 200];
ecatExtSP0=["",  10,  10,  10,  10,  10,  10,  10];
ecatExtBRK=["", 200, 200, 200, 200, 200, 200, 200];
ecatExtMXC=["",   0,   0,   0,   0,   0,   0,   0];
ecatExtHLD=["",  20,  20,  20,  20,  20,  20,  20];
                             #** 伺服驅動器預設參數
#ecatPwmRST=["", 150,   0,   0,   0,   0,   0,   0];
#ecatIopMOD=["",   0,   0,   0,   0,   0,   0,   0];
#ecatIopPWM=["",   0,   0,   0,   0,   0,   0,   0];

